DFRobot/NuvotonDuino/cores/NUC123/usbd.cpp
        if(g_usbd_CtrlOutSize < g_usbd_CtrlOutSizeLimit)
            USBD_SET_PAYLOAD_LEN(EP1, g_usbd_CtrlMaxPktSize);

    }
}

/**
  * @brief    Reset software flags
  *
  * @param    None
  *
  * @return   None
  *
  * @details  This function resets all variables for protocol and resets USB device address to 0.
  *
  */
void USBD_SwReset(void)
{
    // Reset all variables for protocol
    g_usbd_CtrlInPointer = 0;
    g_usbd_CtrlInSize = 0;
    g_usbd_CtrlOutPointer = 0;
    g_usbd_CtrlOutSize = 0;
    g_usbd_CtrlOutSizeLimit = 0;
    g_u32EpStallLock = 0;
    memset(g_usbd_SetupPacket, 0, 8);

    // Reset USB device address
    USBD_SET_ADDR(0);
}

/**
 * @brief       USBD Set Vendor Request
 *
 * @param[in]   pfnVendorReq    Vendor Request Callback Function
 *
 * @return      None
 *
 * @details     This function is used to set USBD vendor request callback function
 */
void USBD_SetVendorRequest(VENDOR_REQ pfnVendorReq)
{
    g_usbd_pfnVendorRequest = pfnVendorReq;
}

/**
 * @brief       The callback function which called when get SET CONFIGURATION request
 *
 * @param[in]   pfnSetConfigCallback    Callback function pointer for SET CONFIGURATION request
 *
 * @return      None
 *
 * @details     This function is used to set the callback function which will be called at SET CONFIGURATION request.
 */
void USBD_SetConfigCallback(SET_CONFIG_CB pfnSetConfigCallback)
{
    g_usbd_pfnSetConfigCallback = pfnSetConfigCallback;
}


/**
 * @brief       The callback function which called when get GET HID REPORT DESCRIPTOR request
 *
 * @param[in]   pfnGetHidReportCallback    Callback function pointer for GET HID REPORT DESCRIPTOR request
 *
 * @return      None
 *
 * @details     This function is used to set the callback function which will be called at GET HID REPORT DESCRIPTOR.
 */
void USBD_HidReportCallback(GET_HID_RPT_CB pfnGetHidReportCallback)
{
    g_usbd_pfnGetHidReportCallback = pfnGetHidReportCallback;
}

/**
 * @brief       EP stall lock function to avoid stall clear by USB SET FEATURE request.
 *
 * @param[in]   u32EpBitmap    Use bitmap to select which endpoints will be locked
 *
 * @return      None
 *
 * @details     This function is used to lock relative endpoint to avoid stall clear by SET FEATURE requst.
 *              If ep stall locked, user needs to reset USB device or re-configure device to clear it.
 */
void USBD_LockEpStall(uint32_t u32EpBitmap)
{
    g_u32EpStallLock = u32EpBitmap;
}
volatile int8_t gi8BulkOutReady = 0;
volatile int8_t gi8BulkInReady = 0;

uint8_t gRxBuf[64] = {0};
volatile uint8_t *gpu8RxBuf = 0;
volatile uint32_t gu32RxSize = 0;
volatile uint32_t gu32TxSize = 0;

/*--------------------------------------------------------------------------*/
STR_VCOM_LINE_CODING gLineCoding = {115200, 0, 0, 8};   /* Baud rate : 115200    */
/* Stop bit     */
/* parity       */
/* data bits    */
uint16_t gCtrlSignal = 0;     /* BIT0: DTR(Data Terminal Ready) , BIT1: RTS(Request To Send) */



int USB_Read(uint8_t *buf)
{
	int ret=0;
	if(gi8BulkOutReady){
		memcpy((void *)buf,(const void*)gpu8RxBuf,(unsigned int)gu32RxSize);
		ret = gu32RxSize;
		gu32RxSize = 0;
		gi8BulkOutReady = 0;
		USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);
	}
	return ret;
}

void USB_Write(const uint8_t *buf,int len)
{
	barrier();
	gi8BulkInReady = 0;
	barrier();
	USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), (uint8_t *)buf, len);
	barrier();
	USBD_SET_PAYLOAD_LEN(EP2, len);
	barrier();
	while(gi8BulkInReady == 0) barrier();;
	gi8BulkInReady = 0;
	barrier();
	/*
	if(len <8)
		delay(4);
	else
		delay(len/4);
	
	*/
}




/*@}*/ /* end of group USBD_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group USBD_Driver */

/*@}*/ /* end of group Standard_Driver */

#ifdef __cplusplus
}
#endif

/*** (C) COPYRIGHT 2014~2015 Nuvoton Technology Corp. ***/





